tutorials/gasifier/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      binary;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry           on;

chemistryType
{
    solver            ode;
}

solidChemistryType
{
    solver              solidOde;
    method              ODESolidHeterogeneousChemistryModel;
    solidThermoType     const<constRad<constThermo<constRho>>>;
}

chemistrySolver     ode;

solidChemistrySolver	solidOde;

initialChemicalTimeStep 1e-5;

turbulentReaction   off;
solidReactionEnergyFromEnthalpy false;
stoichiometricReactions false;
showRelativeReactionRates false;

diffusionLimitedReactions true;

odeCoeffs
{
    solver          seulex;
}

solidOdeCoeffs
{
    solver      seulex;
}

species 	//gasous products of reactions
(
    CO N2 O2 
);

solidReactions
(
    irreversibleSolidArrheniusHeterogeneousReaction
    wood + 1.25 O2 = 0.5 ash + 1.75 CO 
    (5.61e9 1.96e4 300 -6.22e6  1. 1.0)
);

// ************************************************************************* //


